//
//  InitialQuiz.swift
//  CollaboGame
//
//  Created by 순진이 on 2022/05/09.
//

import Foundation

class InitialQuiz {
    static let shared = InitialQuiz()
    private init() {}
    
    let quiz = [
        "과자" : ["새우깡", "촉촉한초코칩", "꼬깔콘", "뿌셔뿌셔", "칙촉", "엄마손파이", "마가렛트", "초코파이", "오예스", "몽쉘", "매운새우깡", "오사쯔", "빼빼로", "누드빼빼로", "콘칩", "통크", "빅파이", "쿠쿠다스", "화이트하임", "초코하임", "오감자", "자가비", "치토스", "감자깡", "크로플", "양파링", "포테토칩", "죠리퐁", "사또밥", "꽃게랑", "못말리는신짱", "카라멜콘땅콩", "허니버터칩", "뻥이요", "빠새", "콰삭칩", "칸츄리콘", "콘치즈", "에이스", "오잉", "웨하스", "츄러스", "꼬북칩", "고래밥", "썬칩", "포스틱", "짜파링", "눈을감자", "옥수수깡", "고구마깡", "오징어집", "자갈치", "포카칩", "후레쉬베리", "후렌치파이", "도리토스", "벌집핏자", "꿀꽈배기", "인디안밥", "조청유과", "쌀로별", "홈런볼", "칸쵸", "초코송이", "카스타드", "버터링", "예감", "고소미", "다이제", "빠다코코넛", "뽀또", "빈츠", "아이비", "땅콩국희샌드", "미쯔", "크라운산도", "롤리폴리", "제크", "오뜨", "롯데샌드", "와클", "치킨팝", "구운양파", "닭다리", "콘초", "야채타임", "맛동산", "바나나킥", "오징어땅콩", "오레오", "알새우칩"],
        
        "라면" : ["안성탕면", "신라면", "짜파게티", "너구리", "감자면", "사리곰탕", "멸치칼국수", "신라면건면", "카구리", "사천백짬뽕", "무파마", "틈새라면", "참께라면", "팔도비빔면", "팔도비빔면", "왕뚜껑", "꼬꼬면", "육개장", "김치큰사발면", "진라면", "스낵면", "컵누들", "스파게티", "삼양라면", "오징어짬뽕", "열라면", "오동통면", "튀김우동", "간짬뽕", "짜짜로니", "쇠고기면", "수타면", "나가사끼짬뽕", "불닭볶음면", "진짬뽕", "진비빔면", "배홍동비빔면", "우육탕면", "새우탕", "치즈볶이", "순후추라면", "짜왕", "속초홍게라면", "짜파게티범벅", "마라탕면", "마라샹궈면", "힐러"],
        
        "아이스크림" : ["아맛나", "바밤바", "돼지바", "폴라포", "월드콘", "티코", "월드콘", "빵또아", "초코마루", "녹차마루", "호두마루", "꿀호떡", "붕어싸만코", "팥빙수", "하겐다즈", "구구콘", "끌레도르", "별난바", "누가바", "체리마루", "메로나", "비비빅", "빙빙바", "보석바", "옥동자", "위즐", "투게더", "조안나", "서주아이스크림", "빠삐코", "찰옥수수", "주물럭", "요맘때", "수박바", "쌍쌍바", "메가톤", "스크류바", "엔초", "브라보콘", "탱크보이", "뽕따", "젤루조아", "와", "토마토마", "와일드바디", "보석바", "더위사냥", "아시나요", "설레임", "셀렉션", "팽이팽이", "쿠키오", "엑설런트", "링키바", "앙꼬바", "죠스바", "거북알", "캔디바", "더블비얀코", "빵빠레", "슈퍼콘", "찰떡아이스"],
    ]
}
