//
//  Movie.swift
//  CollaboGame
//
//  Created by 송결 on 2022/05/18.
//

import Foundation

class MovieLine {
    static let shared = MovieLine()
    
    let movieQ = ["문제":["넌 나에게 모욕감을 줬어.",
                        "거 좀 힘들다고 울어 버릇하지마, 어차피 내일도 힘들어.",
                        "길은 모두에게 열려있지만 모두가 그 길을 가질 수 있는건 아니다.",
                        "행복한지 따져보는 건 우울해지는 지름길이야.",
                        "단지 두려움 때문에 좋아하는 일을 포기하지마.",
                        "호의가 계속되면 그게 권리인 줄 알아.",
                        "내일만 사는 놈은 오늘만 사는 놈한테 죽는다.",
                        "내 인생은 비극인 줄 알았는데 코미디였어.",
                        "우리가 돈이 없지, 가오가 없냐.",
                        
                        
                       ]]
    
    let movieA = ["넌 나에게 모욕감을 줬어.": "달콤한 인생",
                  "거 좀 힘들다고 울어 버릇하지마, 어차피 내일도 힘들어.": "스물",
                  "길은 모두에게 열려있지만 모두가 그 길을 가질 수 있는건 아니다.": "인턴",
                  "행복한지 따져보는 건 우울해지는 지름길이야.": "우리의 20세기",
                  "단지 두려움 때문에 좋아하는 일을 포기하지마.": "씽(Sing)",
                  "호의가 계속되면 그게 권리인 줄 알아.": "부당거래",
                  "내일만 사는 놈은 오늘만 사는 놈한테 죽는다.": "아저씨",
                  "내 인생은 비극인 줄 알았는데 코미디였어.": "조커",
                  "우리가 돈이 없지, 가오가 없냐.": "베테랑",
                  
                  
                  
                  
                  
    ]
}
