//
//  NewSaying.swift
//  CollaboGame
//
//  Created by 송결 on 2022/05/15.
//

import Foundation

class NewSaying {
    static let shared = NewSaying()
    
    let newSayingQ = ["문제":["낄끼빠빠", "비담", "동사나사", "좋댓구알", "무물보", "쉽살재빙", "반모", "좋못사", "오저치고", "강직인", "실드관말", "반신", "사바사", "손놈", "꾸꾸꾸", "남아공", "오놀아놈", "갑통알", "빠태", "랜친실안", "추미스", "자강두천", "H워얼V", "싫존주의", "너또다", "저메추", "당모치", "이왜진", "아더메치", "우심뽀까", "우유남", "장미단추", "TMI", "워라밸", "갑붕싸", "MBC", "귀공자", "말또서", "우귀체",
                           ]]
    
    let newSayingA = ["낄끼빠빠": "낄 때 끼고 빠질 때 빠져라",
                      "비담": "비주얼 담당",
                      "동사나사": "동기 사랑은 나라 사랑",
                      "좋댓구알": "좋아요 댓글 구독 알림설정",
                      "무물보": "무엇이든 물어보세요",
                      "쉽살재빙": "쉽게만 살면 재이없어 빙고",
                      "반모": "반말모드",
                      "좋못사": "좋다 못해 사랑한다",
                      "오저치고": "오늘 저녁 치킨 고",
                      "강직인": "강아지를 키우는 직장인",
                      "실드관말": "실패한 드립에 관심주지 말라",
                      "반신": "반말 신청",
                      "사바사": "사람 by 사람",
                      "손놈": "손님이지만 매너 없는 사람",
                      "꾸꾸꾸": "꾸며도 꾸질 꾸질",
                      "남아공": "남아서 공부나 해라",
                      "오놀아놈": "오우 좀 놀 줄 아는 놈인가",
                      "갑통알": "갑자기 통장을 보니 아르바이트해야 할 것 같다",
                      "빠태": "빠른 태세 전환",
                      "랜친실안": "랜선으로 친하지만 실제론 안 친함",
                      "추미스": "추격 미스테리 스릴러",
                      "자강두천": "자존심 강한 두 천재(도긴개긴)",
                      "H워얼V": "거꾸로 뒤집으면 '사랑해'",
                      "싫존주의": "싫어하는 것도 존중해라",
                      "너또다": "너가 또라이라 다행이다",
                      "저메추": "저녁메뉴 추천",
                      "당모치": "당연히 모든 치킨은 옳다",
                      "이왜진": "이게 왜 진짜야",
                      "아더메치": "아니꼽고 더럽고 메스껍고 치사하다",
                      "우심뽀까": "우리 심심한데 뽀뽀나 할까",
                      "우유남": "우월한 유전자 남자",
                      "장미단추": "장거리 미남 단거리 추남",
                      "TMI": "Too Much Information",
                      "워라밸": "워크 라이프 밸런스",
                      "갑붕싸": "갑자기 붕어싸만코 먹고싶다",
                      "MBC": "밑반찬",
                      "귀공자": "귀한 공부시간에 자는 놈",
                      "말또서": "말을 또 서운하게 한다",
                      "우귀체": "우주에서 최고 귀여운 생명체",
    ]
    
}
