//
//  Person.swift
//  CollaboGame
//
//  Created by 순진이 on 2022/05/19.
//

import Foundation
class Person {
    static let shared = Person()
    private init() {}
    
    let teststt = [
        "원빈", "강호동", "서수남", "이종석", "이민호", "KCM", "박명수", "지석진", "김경식", "손흥민", "강남", "이용진", "이진호",  "이정재", "하정우", "정우성", "양요섭", "윤두준", "권지용", "붐", "신동엽", "이선균", "김종국", "공유", "서강준", "박보검", "서인국", "소지섭", "변요한", "유세윤", "유상무", "장동민", "허경환", "김원효", "한석규", "류승룡", "배용준", "김국진", "김준현", "유민상", "문세윤", "정현돈", "김기수", "강동원", "원빈", "현빈", "유아인", "류준열", "고경표", "정경호", "신하균", "김희철", "피오", "규현", "이수혁", "송중기", "정용화", "이승기", "조권", "박해일", "이병헌", "조진웅", "마동석", "장혁", "송승헌", "유승호", "김지석", "주진모", "박영규", "김무열", "주지훈", "고창석", "이수근", "레오나르도 디카프리오", "트럼프", "베컴", "브래드 피트", "조셉 고든 래빗", "제이크 질렌할", "벤 에플렉", "톰 하디", "리암 니슨", "송강호", "모건 프리먼", "크리스 헴스워스", "크리스찬 베일", "크리스 프랫", "베네딕트 컴버배치", "베네딕 웡", "조지 클루니", "제이슨 스타뎀", "조니 뎁", "빈 디젤", "조쉬 하트넷", "데인 드한", "티모시 샬라메", "애쉬튼 커쳐", "로버트 다우니 주니어", "휴 잭맨", "드웨인 존슨", "윌 스미스", "김영삼", "이명박",
    ]

    let famousWomen = [
        "강부자", "문채원", "김고은", "제시", "김다미", "김연경", "김숙", "앤 해서웨이", "산드라 블록", "윤여정", "이영지", "이성경", "탕웨이", "스칼렛 요한슨", "샤를리즈 테론", "엄지원", "라미란", "전소민", "한소희", "정호연", "이하늬", "김하늘", "황신혜", "진지희", "려원", "레이첼 맥아담스", "김세정", "신봉선", "김아중", "박슬기", "신세경", "박나래", "이은형", "박진주", "박경혜", "한효주", "한고은", "박은빈", "김희선", "이보영", "유인나", "전도연", "고아라", "수애", "이다희", "김유정", "김나영", "박미선", "이지혜", "에일리", "엄정화", "현아", "선미", "사나", "쯔위", "전소미", "슬기", "안유진", "소연", "갤 가돗", "제니", "", "", "", "", "",
    ]

    let famousMen = ["원빈", "강호동", "서수남", "이종석", "이민호", "KCM", "박명수", "지석진", "강남", "손흥민", "모건 프리먼", "윤석열", "하정우", "허경영", "안철수", "전현무", "허성태", "임원희", "정만식", "안내상", "조 바이든", "조셉 고든 래빗", "베네딕트 컴버배치", "제이슨 스타뎀", "제이크 질렌할", "문세윤", "모건 프리먼", "크리스찬 베일", "이명박", "티모시 샬라메", "휴 잭맨", "로버트 다우니 주니어", "조진웅", "마동석", "붐", "신동엽", "이선균", "김종국", "톰 하디", "김지석", "이승기", "조정석", "드웨인 존슨", "류승룡", "이병헌", "김원효"]
}
