//
//  Person.swift
//  CollaboGame
//
//  Created by 순진이 on 2022/05/19.
//

import Foundation
class Person {
    static let shared = Person()
    private init() {}
    
    let famousMen = [
        "원빈", "강호동", "서수남", "이종석", "이민호", "김준호", "KCM", "박명수", "지석진", "이광수", "하하", "정준하", "김경식", "이용진", "이진호", "윤석열", "이정재", "하정우", "정우성", "양요섭", "윤두준", "권지용", "붐", "신동엽", "허경영", "안철수", "이선균", "김종국", "공유", "서강준", "전현무", "박보검", "서인국", "소지섭", "변요한", "유세윤", "유상무", "장동민", "허경환", "김원효", "한석규", "류승룡", "배용준", "김국진", "김준현", "유민상", "문세윤", "정현돈", "김기수", "허성태", "강동원", "원빈", "현빈", "유아인", "류준열", "고경표", "정경호", "신하균", "김희철", "임원희", "피오", "규현", "이수혁", "송중기", "정용화", "남주혁", "이승기", "조권", "박해일", "이병헌", "조진웅", "마동석", "장혁", "송승헌", "유승호", "김지석", "주진모", "박영규", "안내상", "김무열", "정만식", "주지훈", "고창석", "이수근", "레오나르도 디카프리오", "트럼프", "베컴", "브래드 피트", "조셉 고든 래빗", "제이크 질렌할", "벤 에플렉", "톰 하디", "리암 니슨", "송강호", "모건 프리먼", "크리스 헴스워스", "크리스찬 베일", "크리스 프랫", "베네딕트 컴버배치", "베네딕 웡", "조지 클루니", "제이슨 스타뎀", "조니 뎁", "빈 디젤", "조쉬 하트넷", "데인 드한", "티모시 샬라메", "애쉬튼 커쳐", "로버트 다우니 주니어", "휴 잭맨", "드웨인 존슨", "윌 스미스", "김영삼", "이명박", "손흥민"
    ]
    let famousWomen = [
        "윤여정", "문채원", ""
    ]
    
}
